Reports/ТаблицаСоперниковКоманды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ТаблицаСоперниковКоманды</Name>
		</Properties>
	</Report>
</MetaDataObject>

Documents/Тур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Тур</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Игры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сезоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СыграноИгр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Игры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хозяин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гость</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сыгран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МЗ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ТаблицаСоперниковКоманды/Forms/ФормаОтчета/Ext/Form/Module.bsl
// http://infostart.ru/public/78455/

Перем Дата;

&НаКлиенте
Процедура Сформировать(Команда)
		
	Обновить()
	
КонецПроцедуры

&НаСервере
Процедура Обновить() Экспорт
	
	Макет = Отчеты.ТаблицыКоманд.ПолучитьМакет("Макет");
	
	// для отладки использовать
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");	// или этот отчет
	Макет = ЭтотОтчет.мВернутьМакет();
	// "обратно" после работы с макетом
	// ЗначениеВРеквизитФормы(Макет, "Отчет");
	// нет необходимости - вывод уже сделан
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	//КоличествоКоманд = обПолучитьКоличествоКомандВСезоне(Сезон);
	//ПоследнийТурСезона = (КоличествоКоманд - 1) * 2;
	

	ТабДок.Очистить();
	ОбластьЗаголовок.Параметры.Заголовок = ?(ДВ=1, "Итоговая таблица", ?(ДВ=2,"дома", "выезд"));
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ТабДок.Рисунки.Очистить();
	нетЦв = Новый Цвет;
	
	// текущие результаты
	тз1 = обПолучитьТекущиеМестаСоперниковКоманды(Команда, ДВ, Сезон1, Сезон2);
	
	счМесто = 1;
	_о = 0; _в=0; _мз=0; _мп=0;
	
	Для каждого стр из Тз1 Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьДетальныхЗаписей.Параметры, стр);
		
		РМ = стр.РазнМячей;
		Если Не РМ = Null Тогда
			РМ = ?(РМ > 0, "+", "") + РМ;
		Иначе 
			РМ = "0"
		КонецЕсли;
		ОбластьДетальныхЗаписей.Параметры.РазнМячей = РМ;
		
		// если показатели одинаковы абсолютно
		Если стр.Очки=_о и стр.Выигр=_в и стр.МЗ=_мз и стр.мп=_мп Тогда
			ОбластьДетальныхЗаписей.Параметры.Место = "";
		Иначе	
			ОбластьДетальныхЗаписей.Параметры.Место = ""+счМесто+".";
		КонецЕсли;	
		_о = стр.Очки; _в=стр.Выигр; _мз=стр.МЗ; _мп=стр.МП;
			
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
		счМесто = счМесто + 1;
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// реквизит отчета
	Сезон2 = Константы.ТекущийСезон.Получить();
	Сезон1 = Сезон2;
	ДВ = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Тур.Дата КАК Дата
	|ИЗ
	|	Документ.Тур КАК Тур
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Дата = Выборка.Дата
	Иначе
		Дата = ТекущаяДата()
	КонецЕсли;
	
	
	// можно с НачПериода по КонПериода, по N-тур с н.г., за 1(2) круг,с N по M туры !!!
	// нужна таблица соответствия туров и дат
	//
	// далее возможна статистика: СЕРИИ КОМАНД и т.п.
	//
	// РЕАЛИЗОВЫВАТЬ !
	
	Обновить()
	
КонецПроцедуры

&НаКлиенте
Процедура ДВПриИзменении(Элемент)
	
	Обновить()
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Команда, Сезон, ДВ, КомандаСоперник", Расшифровка, Сезон2, ДВ, Команда);
	ОткрытьФорму("Отчет.ДанныеПоКоманде.Форма.ФормаОтчета", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	
	Обновить()
	
КонецПроцедуры
